Fireflyluo/CH32V208_dome/ch32v208_tmos_cdc2/bsp/drv_i2c.c
        // 启用 I2C 中断：事件、错误和缓冲区中断
        I2C_ITConfig(i2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, ENABLE);
    }

    // 配置 DMA（如果使能 DMA 模式）
    if (init_cfg->mode == I2C_MODE_DMA)
    {
        I2C_DMACmd(i2c, ENABLE);
    }

    return I2C_OK;
}

void bsp_i2c_deinit(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);

    // 禁用 I2C
    I2C_Cmd(i2c, DISABLE);

    // 禁用中断
    I2C_ITConfig(i2c, I2C_IT_BUF | I2C_IT_EVT | I2C_IT_ERR, DISABLE);

    // 复位 I2C
    if (i2c_num == I2C_NUM_1)
    {
        RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C1, ENABLE);
        RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C1, DISABLE);
    }
    else
    {
        RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C2, ENABLE);
        RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C2, DISABLE);
    }

    // 清空句柄
    memset(hi2c, 0, sizeof(I2C_HandleTypeDef));
}

/* ========================== 状态查询函数 ========================== */

I2C_StateTypeDef bsp_i2c_get_state(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_STATE_ERROR;
    return get_handle(i2c_num)->State;
}

bool bsp_i2c_is_busy(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return true;
    I2C_TypeDef *i2c = get_periph(i2c_num);
    return I2C_GetFlagStatus(i2c, I2C_FLAG_BUSY) == SET;
}

uint32_t bsp_i2c_get_error(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;
    return get_handle(i2c_num)->ErrorCode;
}

/* ========================== 轮询模式函数 ========================== */

int bsp_i2c_write_polling(i2c_num_t i2c_num, uint8_t dev_addr,
                          const uint8_t *data, uint16_t len, uint32_t timeout)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);
    int ret;

    hi2c->State = I2C_STATE_BUSY_TX;

    // 等待总线空闲
    ret = wait_flag(i2c, I2C_FLAG_BUSY, RESET, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送 START
    I2C_GenerateSTART(i2c, ENABLE);
    ret = wait_event(i2c, I2C_EVENT_MASTER_MODE_SELECT, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送地址
    I2C_Send7bitAddress(i2c, dev_addr << 1, I2C_Direction_Transmitter);
    ret = wait_event(i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送数据
    for (uint16_t i = 0; i < len; i++)
    {
        ret = wait_flag(i2c, I2C_FLAG_TXE, SET, timeout);
        if (ret != I2C_OK)
            goto error;
        I2C_SendData(i2c, data[i]);
    }

    // 等待传输完成
    ret = wait_event(i2c, I2C_EVENT_MASTER_BYTE_TRANSMITTED, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送 STOP
    I2C_GenerateSTOP(i2c, ENABLE);

    hi2c->State = I2C_STATE_IDLE;
    return I2C_OK;

error:
    I2C_GenerateSTOP(i2c, ENABLE);
    hi2c->State = I2C_STATE_ERROR;
    hi2c->ErrorCode = ret;
    return ret;
}

int bsp_i2c_read_polling(i2c_num_t i2c_num, uint8_t dev_addr,
                         uint8_t *data, uint16_t len, uint32_t timeout)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);
    int ret;

    hi2c->State = I2C_STATE_BUSY_RX;

    // 等待总线空闲
    ret = wait_flag(i2c, I2C_FLAG_BUSY, RESET, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送 START
    I2C_GenerateSTART(i2c, ENABLE);
    ret = wait_event(i2c, I2C_EVENT_MASTER_MODE_SELECT, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送地址（读模式）
    I2C_Send7bitAddress(i2c, dev_addr << 1, I2C_Direction_Receiver);
    ret = wait_event(i2c, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, timeout);
    if (ret != I2C_OK)
        goto error;

    // 读取数据
    for (uint16_t i = 0; i < len; i++)
    {
        if (i == len - 1)
        {
            // 最后一个字节，发送 NACK
            I2C_AcknowledgeConfig(i2c, DISABLE);
        }

        ret = wait_flag(i2c, I2C_FLAG_RXNE, SET, timeout);
        if (ret != I2C_OK)
            goto error;

        data[i] = I2C_ReceiveData(i2c);
    }

    // 发送 STOP
    I2C_GenerateSTOP(i2c, ENABLE);
    I2C_AcknowledgeConfig(i2c, ENABLE);

    hi2c->State = I2C_STATE_IDLE;
    return I2C_OK;

error:
    I2C_GenerateSTOP(i2c, ENABLE);
    I2C_AcknowledgeConfig(i2c, ENABLE);
    hi2c->State = I2C_STATE_ERROR;
    hi2c->ErrorCode = ret;
    return ret;
}

int bsp_i2c_write_register_polling(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                                   const uint8_t *data, uint16_t len, uint32_t timeout)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);
    int ret;

    hi2c->State = I2C_STATE_BUSY_TX;

    // 等待总线空闲
    ret = wait_flag(i2c, I2C_FLAG_BUSY, RESET, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送 START
    I2C_GenerateSTART(i2c, ENABLE);
    ret = wait_event(i2c, I2C_EVENT_MASTER_MODE_SELECT, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送地址
    I2C_Send7bitAddress(i2c, dev_addr << 1, I2C_Direction_Transmitter);
    ret = wait_event(i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送寄存器地址
    ret = wait_flag(i2c, I2C_FLAG_TXE, SET, timeout);
    if (ret != I2C_OK)
        goto error;
    I2C_SendData(i2c, reg);

    // 发送数据
    for (uint16_t i = 0; i < len; i++)
    {
        ret = wait_flag(i2c, I2C_FLAG_TXE, SET, timeout);
        if (ret != I2C_OK)
            goto error;
        I2C_SendData(i2c, data[i]);
    }

    // 等待传输完成
    ret = wait_event(i2c, I2C_EVENT_MASTER_BYTE_TRANSMITTED, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送 STOP
    I2C_GenerateSTOP(i2c, ENABLE);

    hi2c->State = I2C_STATE_IDLE;
    return I2C_OK;

error:
    I2C_GenerateSTOP(i2c, ENABLE);
    hi2c->State = I2C_STATE_ERROR;
    hi2c->ErrorCode = ret;
    return ret;
}

int bsp_i2c_read_register_polling(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                                  uint8_t *data, uint16_t len, uint32_t timeout)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

