Fireflyluo/CH32V208_dome/ch32v208_tmos_cdc2/bsp/drv_i2c.c
    // 启动传输
    I2C_GenerateSTART(i2c, ENABLE);

    return I2C_OK;
}

int bsp_i2c_write_register_dma(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                               const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0 || len > I2C_MAX_WRITE_LEN - 1)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    // 使用内部缓冲区构造数据
    static uint8_t tx_buf[I2C_NUM_MAX][I2C_MAX_WRITE_LEN];
    tx_buf[i2c_num][0] = reg;
    memcpy(&tx_buf[i2c_num][1], data, len);

    return bsp_i2c_write_dma(i2c_num, dev_addr, tx_buf[i2c_num], len + 1);
}

int bsp_i2c_read_register_dma(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                              uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX || data == NULL || len == 0)
    {
        return I2C_ERR_INVALID_PARAM;
    }

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = get_periph(i2c_num);

    if (hi2c->State != I2C_STATE_IDLE)
    {
        return I2C_ERR_BUSY;
    }

    // 对于 DMA 模式，先使用中断模式发送寄存器地址，然后使用 DMA 接收数据
    // 这里简化为先用轮询发送寄存器地址
    int ret = bsp_i2c_write_polling(i2c_num, dev_addr, &reg, 1, I2C_TIMEOUT_DEFAULT);
    if (ret != I2C_OK)
        return ret;

    return bsp_i2c_read_dma(i2c_num, dev_addr, data, len);
}

/* ========================== 简化接口 ========================== */

int bsp_i2c_write(i2c_num_t i2c_num, uint8_t dev_addr, const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    uint8_t mode = get_handle(i2c_num)->Mode;

    switch (mode)
    {
    case I2C_MODE_POLLING:
        return bsp_i2c_write_polling(i2c_num, dev_addr, data, len, I2C_TIMEOUT_DEFAULT);
    case I2C_MODE_IT:
        return bsp_i2c_write_it(i2c_num, dev_addr, data, len);
    case I2C_MODE_DMA:
        return bsp_i2c_write_dma(i2c_num, dev_addr, data, len);
    default:
        return I2C_ERR_INVALID_PARAM;
    }
}

int bsp_i2c_read(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    uint8_t mode = get_handle(i2c_num)->Mode;

    switch (mode)
    {
    case I2C_MODE_POLLING:
        return bsp_i2c_read_polling(i2c_num, dev_addr, data, len, I2C_TIMEOUT_DEFAULT);
    case I2C_MODE_IT:
        return bsp_i2c_read_it(i2c_num, dev_addr, data, len);
    case I2C_MODE_DMA:
        return bsp_i2c_read_dma(i2c_num, dev_addr, data, len);
    default:
        return I2C_ERR_INVALID_PARAM;
    }
}

int bsp_i2c_write_register(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                           const uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    uint8_t mode = get_handle(i2c_num)->Mode;

    switch (mode)
    {
    case I2C_MODE_POLLING:
        return bsp_i2c_write_register_polling(i2c_num, dev_addr, reg, data, len, I2C_TIMEOUT_DEFAULT);
    case I2C_MODE_IT:
        return bsp_i2c_write_register_it(i2c_num, dev_addr, reg, data, len);
    case I2C_MODE_DMA:
        return bsp_i2c_write_register_dma(i2c_num, dev_addr, reg, data, len);
    default:
        return I2C_ERR_INVALID_PARAM;
    }
}

int bsp_i2c_read_register(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg,
                          uint8_t *data, uint16_t len)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    uint8_t mode = get_handle(i2c_num)->Mode;

    switch (mode)
    {
    case I2C_MODE_POLLING:
        return bsp_i2c_read_register_polling(i2c_num, dev_addr, reg, data, len, I2C_TIMEOUT_DEFAULT);
    case I2C_MODE_IT:
        return bsp_i2c_read_register_it(i2c_num, dev_addr, reg, data, len);
    case I2C_MODE_DMA:
        return bsp_i2c_read_register_dma(i2c_num, dev_addr, reg, data, len);
    default:
        return I2C_ERR_INVALID_PARAM;
    }
}

int bsp_i2c_write_byte(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg, uint8_t data)
{
    return bsp_i2c_write_register(i2c_num, dev_addr, reg, &data, 1);
}

int bsp_i2c_read_byte(i2c_num_t i2c_num, uint8_t dev_addr, uint8_t reg, uint8_t *data)
{
    return bsp_i2c_read_register(i2c_num, dev_addr, reg, data, 1);
}

/* ========================== 设备探测 ========================== */

int bsp_i2c_check_device(i2c_num_t i2c_num, uint8_t dev_addr, uint32_t timeout)
{
    if (i2c_num >= I2C_NUM_MAX)
        return I2C_ERR_INVALID_PARAM;

    I2C_TypeDef *i2c = get_periph(i2c_num);
    int ret;

    // 等待总线空闲
    ret = wait_flag(i2c, I2C_FLAG_BUSY, RESET, timeout);
    if (ret != I2C_OK)
        return ret;

    // 发送 START
    I2C_GenerateSTART(i2c, ENABLE);
    ret = wait_event(i2c, I2C_EVENT_MASTER_MODE_SELECT, timeout);
    if (ret != I2C_OK)
        goto error;

    // 发送地址
    I2C_Send7bitAddress(i2c, dev_addr << 1, I2C_Direction_Transmitter);

    // 等待 ACK
    ret = wait_event(i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, timeout);

error:
    // 发送 STOP
    I2C_GenerateSTOP(i2c, ENABLE);

    return (ret == I2C_OK) ? I2C_OK : I2C_ERR_AF;
}

uint8_t bsp_i2c_scan(i2c_num_t i2c_num, uint8_t *found_addr, uint8_t max_count)
{
    if (i2c_num >= I2C_NUM_MAX || found_addr == NULL || max_count == 0)
    {
        return 0;
    }

    uint8_t count = 0;

    // 扫描 0x08 - 0x77 范围内的地址
    for (uint8_t addr = 0x08; addr <= 0x77 && count < max_count; addr++)
    {
        if (bsp_i2c_check_device(i2c_num, addr, 1000) == I2C_OK)
        {
            found_addr[count++] = addr;
        }
    }

    return count;
}

/* ========================== 回调函数注册 ========================== */

void bsp_i2c_register_tx_callback(i2c_num_t i2c_num, bsp_i2c_callback_t callback)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;
    get_handle(i2c_num)->TxCpltCallback = callback;
}

void bsp_i2c_register_rx_callback(i2c_num_t i2c_num, bsp_i2c_callback_t callback)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;
    get_handle(i2c_num)->RxCpltCallback = callback;
}

void bsp_i2c_register_error_callback(i2c_num_t i2c_num, bsp_i2c_error_callback_t callback)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;
    get_handle(i2c_num)->ErrorCallback = callback;
}

