Fireflyluo/CH32V208_dome/ch32v208_tmos_cdc2/bsp/drv_i2c.c
/* ========================== 中断处理 ========================== */

static void i2c_ev_handler(I2C_HandleTypeDef *hi2c, i2c_num_t num)
{
    I2C_TypeDef *i2c = hi2c->Instance;

    // 1. SB - START 条件已发送
    if (I2C_GetITStatus(i2c, I2C_IT_SB))
    {
        if (hi2c->IsRegWrite && hi2c->RxLength > 0)
        {
            // 寄存器读操作，先写寄存器地址
            I2C_Send7bitAddress(i2c, hi2c->DevAddr << 1, I2C_Direction_Transmitter);
        }
        else if (hi2c->RxLength > 0)
        {
            // 直接读
            I2C_Send7bitAddress(i2c, hi2c->DevAddr << 1, I2C_Direction_Receiver);
        }
        else
        {
            // 写操作
            I2C_Send7bitAddress(i2c, hi2c->DevAddr << 1, I2C_Direction_Transmitter);
        }
    }
    // 2. ADDR - 地址已发送
    else if (I2C_GetITStatus(i2c, I2C_IT_ADDR))
    {
        // 清除 ADDR 标志
        __IO uint32_t tmp = i2c->STAR1;
        tmp = i2c->STAR2;
        (void)tmp;

        // 如果是接收模式且只剩1字节，提前禁用 ACK
        if (hi2c->RxLength == 1 && !hi2c->IsRegWrite)
        {
            I2C_AcknowledgeConfig(i2c, DISABLE);
        }
    }
    // 3. TXE - 发送缓冲区空
    else if (I2C_GetITStatus(i2c, I2C_IT_TXE))
    {
        if (hi2c->TxCount < hi2c->TxLength)
        {
            if (hi2c->IsRegWrite && hi2c->TxCount == 0)
            {
                // 发送寄存器地址
                I2C_SendData(i2c, hi2c->RegAddr);
            }
            else
            {
                I2C_SendData(i2c, hi2c->pTxBuffer[hi2c->TxCount]);
            }
            hi2c->TxCount++;
        }
        else
        {
            // 发送完成
            if (hi2c->IsRegWrite && hi2c->RxLength > 0)
            {
                // 寄存器写完成，准备读
                hi2c->IsRegWrite = false;
                hi2c->State = I2C_STATE_BUSY_RX;
                I2C_GenerateSTART(i2c, ENABLE);
            }
            else
            {
                // 普通写完成
                I2C_GenerateSTOP(i2c, ENABLE);
                hi2c->State = I2C_STATE_IDLE;

                if (hi2c->TxCpltCallback)
                {
                    hi2c->TxCpltCallback(num);
                }
            }
        }
    }
    // 4. RXNE - 接收缓冲区非空
    else if (I2C_GetITStatus(i2c, I2C_IT_RXNE))
    {
        if (hi2c->RxCount < hi2c->RxLength)
        {
            hi2c->pRxBuffer[hi2c->RxCount++] = I2C_ReceiveData(i2c);

            if (hi2c->RxCount == hi2c->RxLength - 1)
            {
                // 下一个字节是最后一个，禁用 ACK
                I2C_AcknowledgeConfig(i2c, DISABLE);
            }
            else if (hi2c->RxCount >= hi2c->RxLength)
            {
                // 接收完成
                I2C_GenerateSTOP(i2c, ENABLE);
                I2C_AcknowledgeConfig(i2c, ENABLE);
                hi2c->State = I2C_STATE_IDLE;

                if (hi2c->RxCpltCallback)
                {
                    hi2c->RxCpltCallback(num);
                }
            }
        }
    }
}

static void i2c_er_handler(I2C_HandleTypeDef *hi2c, i2c_num_t num)
{
    I2C_TypeDef *i2c = hi2c->Instance;
    uint32_t error = I2C_OK;

    // 检查错误标志
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_AF))
    {
        I2C_ClearFlag(i2c, I2C_FLAG_AF);
        error = I2C_ERR_AF;
    }
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_BERR))
    {
        I2C_ClearFlag(i2c, I2C_FLAG_BERR);
        error = I2C_ERR_BERR;
    }
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_ARLO))
    {
        I2C_ClearFlag(i2c, I2C_FLAG_ARLO);
        error = I2C_ERR_ARLO;
    }

    if (error != I2C_OK)
    {
        I2C_GenerateSTOP(i2c, ENABLE);
        hi2c->State = I2C_STATE_ERROR;
        hi2c->ErrorCode = error;

        if (hi2c->ErrorCallback)
        {
            hi2c->ErrorCallback(num, error);
        }
    }
}

void bsp_i2c_irq_handler(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = hi2c->Instance;

    // 事件中断
    if (I2C_GetITStatus(i2c, I2C_IT_SB) ||
        I2C_GetITStatus(i2c, I2C_IT_ADDR) ||
        I2C_GetITStatus(i2c, I2C_IT_TXE) ||
        I2C_GetITStatus(i2c, I2C_IT_RXNE) ||
        I2C_GetITStatus(i2c, I2C_IT_BTF))
    {
        i2c_ev_handler(hi2c, i2c_num);
    }

    // 错误中断
    if (I2C_GetITStatus(i2c, I2C_IT_ERR))
    {
        i2c_er_handler(hi2c, i2c_num);
    }
}

void bsp_i2c_dma_tx_irq_handler(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = hi2c->Instance;
    DMA_Channel_TypeDef *channel = hi2c->TxDmaChannel;

    if (DMA_GetITStatus(DMA1_IT_TC1 + ((uint32_t)channel - (uint32_t)DMA1_Channel1) / 20))
    {
        DMA_ClearITPendingBit(DMA1_IT_TC1 + ((uint32_t)channel - (uint32_t)DMA1_Channel1) / 20);
        DMA_Cmd(channel, DISABLE);

        // 等待 BTF
        while (!I2C_GetFlagStatus(i2c, I2C_FLAG_BTF))
            ;

        // 发送 STOP
        I2C_GenerateSTOP(i2c, ENABLE);
        I2C_DMACmd(i2c, DISABLE);

        hi2c->State = I2C_STATE_IDLE;

        if (hi2c->TxCpltCallback)
        {
            hi2c->TxCpltCallback(i2c_num);
        }
    }
}

void bsp_i2c_dma_rx_irq_handler(i2c_num_t i2c_num)
{
    if (i2c_num >= I2C_NUM_MAX)
        return;

    I2C_HandleTypeDef *hi2c = get_handle(i2c_num);
    I2C_TypeDef *i2c = hi2c->Instance;
    DMA_Channel_TypeDef *channel = hi2c->RxDmaChannel;

    if (DMA_GetITStatus(DMA1_IT_TC1 + ((uint32_t)channel - (uint32_t)DMA1_Channel1) / 20))
    {
        DMA_ClearITPendingBit(DMA1_IT_TC1 + ((uint32_t)channel - (uint32_t)DMA1_Channel1) / 20);
        DMA_Cmd(channel, DISABLE);

        // 发送 STOP
        I2C_GenerateSTOP(i2c, ENABLE);
        I2C_AcknowledgeConfig(i2c, ENABLE);
        I2C_DMACmd(i2c, DISABLE);

        hi2c->State = I2C_STATE_IDLE;

        if (hi2c->RxCpltCallback)
        {
            hi2c->RxCpltCallback(i2c_num);
        }
    }
}

/* ========================== 弱定义回调 ========================== */

__attribute__((weak)) void bsp_i2c1_tx_cplt_callback(void)
{
}
__attribute__((weak)) void bsp_i2c1_rx_cplt_callback(void)
{
}
__attribute__((weak)) void bsp_i2c1_error_callback(uint32_t error_code)
{
    (void)error_code;
}
__attribute__((weak)) void bsp_i2c2_tx_cplt_callback(void)
{
}
__attribute__((weak)) void bsp_i2c2_rx_cplt_callback(void)
{
}
__attribute__((weak)) void bsp_i2c2_error_callback(uint32_t error_code)
{
    (void)error_code;
}
